profiling/stage6/stage-6_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 84.691ms, rate sampling interval: 455ms
  Thread calibration: mean lat.: 80.251ms, rate sampling interval: 457ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   549.86ms  830.73ms   2.41s    79.63%
    Req/Sec   482.57     73.40   584.00     85.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.78ms
 75.000%    1.17s 
 90.000%    2.05s 
 99.000%    2.33s 
 99.900%    2.39s 
 99.990%    2.41s 
 99.999%    2.41s 
100.000%    2.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.891     0.000000            1         1.00
       3.275     0.100000         4835         1.11
       3.913     0.200000         9648         1.25
       4.491     0.300000        14473         1.43
       5.191     0.400000        19309         1.67
       6.779     0.500000        24122         2.00
       8.735     0.550000        26530         2.22
      18.303     0.600000        28942         2.50
     130.879     0.650000        31355         2.86
     724.991     0.700000        33769         3.33
    1173.503     0.750000        36180         4.00
    1235.967     0.775000        37393         4.44
    1586.175     0.800000        38590         5.00
    1820.671     0.825000        39800         5.71
    1907.711     0.850000        41011         6.67
    1991.679     0.875000        42208         8.00
    2021.375     0.887500        42819         8.89
    2051.071     0.900000        43415        10.00
    2097.151     0.912500        44020        11.43
    2140.159     0.925000        44635        13.33
    2164.735     0.937500        45246        16.00
    2183.167     0.943750        45548        17.78
    2203.647     0.950000        45856        20.00
    2217.983     0.956250        46129        22.86
    2238.463     0.962500        46448        26.67
    2263.039     0.968750        46736        32.00
    2275.327     0.971875        46903        35.56
    2283.519     0.975000        47035        40.00
    2293.759     0.978125        47218        45.71
    2299.903     0.981250        47354        53.33
    2308.095     0.984375        47511        64.00
    2312.191     0.985938        47582        71.11
    2318.335     0.987500        47663        80.00
    2322.431     0.989062        47718        91.43
    2328.575     0.990625        47789       106.67
    2340.863     0.992188        47865       128.00
    2349.055     0.992969        47901       142.22
    2355.199     0.993750        47943       160.00
    2361.343     0.994531        47984       182.86
    2367.487     0.995313        48019       213.33
    2373.631     0.996094        48052       256.00
    2377.727     0.996484        48074       284.44
    2379.775     0.996875        48091       320.00
    2383.871     0.997266        48116       365.71
    2385.919     0.997656        48137       426.67
    2387.967     0.998047        48152       512.00
    2387.967     0.998242        48152       568.89
    2390.015     0.998437        48170       640.00
    2392.063     0.998633        48179       731.43
    2394.111     0.998828        48188       853.33
    2396.159     0.999023        48196      1024.00
    2396.159     0.999121        48196      1137.78
    2398.207     0.999219        48200      1280.00
    2400.255     0.999316        48211      1462.86
    2400.255     0.999414        48211      1706.67
    2402.303     0.999512        48218      2048.00
    2402.303     0.999561        48218      2275.56
    2402.303     0.999609        48218      2560.00
    2404.351     0.999658        48226      2925.71
    2404.351     0.999707        48226      3413.33
    2404.351     0.999756        48226      4096.00
    2404.351     0.999780        48226      4551.11
    2406.399     0.999805        48228      5120.00
    2406.399     0.999829        48228      5851.43
    2408.447     0.999854        48232      6826.67
    2408.447     0.999878        48232      8192.00
    2408.447     0.999890        48232      9102.22
    2408.447     0.999902        48232     10240.00
    2408.447     0.999915        48232     11702.86
    2410.495     0.999927        48233     13653.33
    2414.591     0.999939        48236     16384.00
    2414.591     1.000000        48236          inf
#[Mean    =      549.855, StdDeviation   =      830.726]
#[Max     =     2412.544, Total count    =        48236]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58238 requests in 1.00m, 4.01MB read
Requests/sec:    970.60
Transfer/sec:     68.51KB