profiling/stage6/stage-6_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 106.049ms, rate sampling interval: 629ms
  Thread calibration: mean lat.: 105.760ms, rate sampling interval: 617ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   142.21ms  411.66ms   2.01s    91.19%
    Req/Sec   483.60     57.60   544.00     91.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.34ms
 75.000%    9.44ms
 90.000%  408.06ms
 99.000%    1.94s 
 99.900%    1.98s 
 99.990%    2.00s 
 99.999%    2.01s 
100.000%    2.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.897     0.000000            1         1.00
       3.471     0.100000         4841         1.11
       4.013     0.200000         9690         1.25
       4.419     0.300000        14544         1.43
       4.815     0.400000        19364         1.67
       5.339     0.500000        24200         2.00
       5.731     0.550000        26621         2.22
       6.299     0.600000        29041         2.50
       7.043     0.650000        31450         2.86
       8.031     0.700000        33869         3.33
       9.439     0.750000        36289         4.00
      10.743     0.775000        37498         4.44
      12.999     0.800000        38708         5.00
      20.079     0.825000        39917         5.71
      54.879     0.850000        41127         6.67
     204.799     0.875000        42335         8.00
     292.351     0.887500        42940         8.89
     408.063     0.900000        43544        10.00
     563.199     0.912500        44151        11.43
     729.087     0.925000        44754        13.33
    1127.423     0.937500        45361        16.00
    1262.591     0.943750        45662        17.78
    1333.247     0.950000        45967        20.00
    1384.447     0.956250        46274        22.86
    1441.791     0.962500        46572        26.67
    1636.351     0.968750        46871        32.00
    1773.567     0.971875        47024        35.56
    1814.527     0.975000        47182        40.00
    1827.839     0.978125        47328        45.71
    1841.151     0.981250        47480        53.33
    1862.655     0.984375        47629        64.00
    1917.951     0.985938        47703        71.11
    1928.191     0.987500        47778        80.00
    1938.431     0.989062        47856        91.43
    1944.575     0.990625        47933       106.67
    1948.671     0.992188        48008       128.00
    1950.719     0.992969        48047       142.22
    1952.767     0.993750        48082       160.00
    1954.815     0.994531        48128       182.86
    1956.863     0.995313        48165       213.33
    1958.911     0.996094        48196       256.00
    1960.959     0.996484        48223       284.44
    1961.983     0.996875        48246       320.00
    1963.007     0.997266        48256       365.71
    1965.055     0.997656        48273       426.67
    1967.103     0.998047        48293       512.00
    1968.127     0.998242        48300       568.89
    1969.151     0.998437        48307       640.00
    1973.247     0.998633        48321       731.43
    1975.295     0.998828        48328       853.33
    1977.343     0.999023        48339      1024.00
    1978.367     0.999121        48343      1137.78
    1979.391     0.999219        48347      1280.00
    1980.415     0.999316        48352      1462.86
    1981.439     0.999414        48355      1706.67
    1984.511     0.999512        48360      2048.00
    1986.559     0.999561        48362      2275.56
    1987.583     0.999609        48365      2560.00
    1988.607     0.999658        48366      2925.71
    1993.727     0.999707        48369      3413.33
    1997.823     0.999756        48371      4096.00
    1998.847     0.999780        48373      4551.11
    1998.847     0.999805        48373      5120.00
    2000.895     0.999829        48375      5851.43
    2000.895     0.999854        48375      6826.67
    2002.943     0.999878        48377      8192.00
    2002.943     0.999890        48377      9102.22
    2003.967     0.999902        48378     10240.00
    2003.967     0.999915        48378     11702.86
    2004.991     0.999927        48379     13653.33
    2006.015     0.999939        48381     16384.00
    2006.015     0.999945        48381     18204.44
    2006.015     0.999951        48381     20480.00
    2006.015     0.999957        48381     23405.71
    2006.015     0.999963        48381     27306.67
    2006.015     0.999969        48381     32768.00
    2006.015     0.999973        48381     36408.89
    2006.015     0.999976        48381     40960.00
    2006.015     0.999979        48381     46811.43
    2009.087     0.999982        48382     54613.33
    2009.087     1.000000        48382          inf
#[Mean    =      142.214, StdDeviation   =      411.659]
#[Max     =     2008.064, Total count    =        48382]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58398 requests in 1.00m, 3.73MB read
Requests/sec:    973.23
Transfer/sec:     63.68KB